#include <iostream>
#include "Typing_Intro.h"
#include "Utils.h"

#include <stdio.h>
#include <conio.h>
#include <windows.h>

void showTypingIntro()
{
    char input;
    {
        //타자 게임 출력
        gotoXY(1, 14);
        printf("                 ##                             ###                                ###                            ##\n");
        gotoXY(1, 15);
        printf("                 ##                             ###                          ##    ###         ########           ##\n");
        gotoXY(1, 16);
        printf("#############    ##        ###############      ###         ############     ##    ###       ####     ###         ##\n");
        gotoXY(1, 17);
        printf("##               ##              ###            ###                  ##      ##    ###      ###         ###       ##\n");
        gotoXY(1, 18);
        printf("##               ##              ###            ###                  ##      ##    ###     ###          ###       ##\n");
        gotoXY(1, 19);
        printf("##               ##              ###            ###                 ###      ##    ###     ###          ###       ##\n");
        gotoXY(1, 20);
        printf("##               #######        ####            ########           ###       ##    ###      ###        ###        ##\n");
        gotoXY(1, 21);
        printf("#############    #######       ######           ########           ##  ########    ###        ###########         ##\n");
        gotoXY(1, 22);
        printf("##               ##            ##  ###          ###              ###         ##    ###                            ##\n");
        gotoXY(1, 23);
        printf("##               ##          ###     ##         ###             ###          ##    ###                              \n");
        gotoXY(1, 24);
        printf("##               ##         ###       ###       ###           ###            ##    ###           ###################\n");
        gotoXY(1, 25);
        printf("#############    ##       ###           ###     ###         ###              ##    ###           ##               ##\n");
        gotoXY(1, 26);
        printf("                 ##                             ###                          ##    ###           ##               ##\n");
        gotoXY(1, 27);
        printf("                 ##                             ###                          ##    ###           ###################\n");
        // 타자 게임 설명  출력
        gotoXY(20, 30);
        printf("=====================================================================================\n");
        gotoXY(20, 31);
        printf("|                                                                                   |\n");
        gotoXY(20, 32);
        printf("|                            화면에 문장이 제시됩니다                               |\n");
        gotoXY(20, 33);
        printf("|                         해당 문장을 그대로 입력하세요                             |\n");
        gotoXY(20, 34);
        printf("|    입력을 하고 엔터를 누르면 [오타] [점수] [시간] [타수] 를 확인할 수 있습니다.   |\n");
        gotoXY(20, 35);
        printf("|                                                                                   |\n");
        gotoXY(20, 36);
        printf("=====================================================================================\n");
    }

    printf("\n");

    gotoXY(47, 53);
    printf("[ 게임을 시작하는 중입니다 ]");

    printf("\n");

    Sleep(6000);
    system("cls");
}